Q1. List any five functions of the pandas library with execution.

In [1]:
#DataFrame,head,tail,describe,replace
import pandas as pd

data = {'Name': ['John', 'Jane', 'Jim', 'Joan'],

        'Age': [25, 30, 35, 40],

        'Occupation': ['Engineer', 'Doctor', 'Teacher', 'Lawyer']}

df = pd.DataFrame(data)
df

   Name  Age Occupation
0  John   25   Engineer
1  Jane   30     Doctor
2   Jim   35    Teacher
3  Joan   40     Lawyer

In [3]:
df.head(2)

   Name  Age Occupation
0  John   25   Engineer
1  Jane   30     Doctor

In [4]:
df.tail(1)

   Name  Age Occupation
3  Joan   40     Lawyer

In [5]:
df.Age.describe()

count     4.000000
mean     32.500000
std       6.454972
min      25.000000
25%      28.750000
50%      32.500000
75%      36.250000
max      40.000000
Name: Age, dtype: float64

In [7]:
df.replace(to_replace=['John','Joan'],value=['Michael','Dwight'],inplace=True)
df

      Name  Age Occupation
0  Michael   25   Engineer
1     Jane   30     Doctor
2      Jim   35    Teacher
3   Dwight   40     Lawyer

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [4]:
import pandas as pd
def reindex_df(df):
    new_index = range(1,len(df)*2,2)
    df = df.set_index(pd.Index(new_index))
    return df

In [5]:
df1 = pd.DataFrame({'A':[10,20,30],'B':[5,10,15],'C':[20,40,60]})
new_df =  reindex_df(df1)
new_df

    A   B   C
1  10   5  20
3  20  10  40
5  30  15  60

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.<br>
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [11]:
import pandas as pd
data = {"values":[10,20,30,40,50],"strings":['a','b','c','d','e']}
df1 = pd.DataFrame(data)

In [14]:
def sum_three(df):
    total = 0
    for i,x in df.iterrows():
        if i>2:
            break
        total += x['values']
    print(total)

sum_three(df1)

60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [21]:
import pandas as pd
pd.set_option("display.max_colwidth" , 1000)
df = pd.DataFrame({"text": ["Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.","my name is sudh" , "i use to take data science mastes class"]})
df['word_count'] = df['text'].apply(lambda x : len(x.split()))
df

,text,word_count
0,"Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.",104
1,my name is sudh,4
2,i use to take data science mastes class,8

Q5. How are DataFrame.size() and DataFrame.shape() different?
<br>
size returns the total number of elements in the dataframe while shape returns a tuple containing the no.of rows and columns

Q6. Which function of pandas do we use to read an excel file?
<br>
read_excel

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [32]:
df = pd.DataFrame({'Email':['aritra@gmail.com','rahul@gmail.com','xyz@yahoo.com']})
df['Username'] = df['Email'].apply(lambda x : x.split('@')[0])
df

              Email Username
0  aritra@gmail.com   aritra
1   rahul@gmail.com    rahul
2     xyz@yahoo.com      xyz

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values: <br>
A B C <br>
0 3 5 1<br>
1 8 2 7 <br>
2 6 9 4 <br>
3 2 3 5 <br>
4 9 1 2 <br>
Your function should select the following rows: A B C <br>
1 8 2 7<br>
4 9 1 2<br>
The function should return a new DataFrame that contains only the selected rows.

In [7]:
import pandas as pd
data = {'A':[3,8,6,2,9],'B':[5,2,9,3,1],'C':[1,7,4,5,2]}
df = pd.DataFrame(data)
df1 = df.loc[(df.A>5) & (df.B < 10)]
df1

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [18]:
def display_statistics(df1):
    print(df1['values'].mean())
    print(df1['values'].median())
    print(df1['values'].std())

In [19]:
import pandas as pd
data = {"values":[10,20,30,40,50],"strings":['a','b','c','d','e']}
df = pd.DataFrame(data)
display_statistics(df)

30.0
30.0
15.811388300841896

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [18]:
import pandas as pd
df = pd.read_csv('sales_data_sample.csv')
df1 = df.loc[(df.YEAR_ID)==2005][['SALES','ORDERDATE']]
df1['MovingAverage'] = df1.rolling(window=7).mean()
df1

/tmp/ipykernel_70/2338722268.py:4: FutureWarning: Dropping of nuisance columns in rolling operations is deprecated; in a future version this will raise TypeError. Select only valid columns before calling the operation. Dropped columns were Index(['ORDERDATE'], dtype='object')
  df1['MovingAverage'] = df1.rolling(window=7).mean()

        SALES       ORDERDATE  MovingAverage
22     733.11   2/3/2005 0:00            NaN
23    3207.12   3/3/2005 0:00            NaN
24    2434.56   4/8/2005 0:00            NaN
25    7516.08  5/13/2005 0:00            NaN
49    4514.92  1/20/2005 0:00            NaN
...       ...             ...            ...
2796  2419.62   5/9/2005 0:00    2228.117143
2819  3978.51  1/31/2005 0:00    2506.275714
2820  5417.57   3/1/2005 0:00    2898.190000
2821  2116.16  3/28/2005 0:00    2968.462857
2822  3079.44   5/6/2005 0:00    2785.882857

[478 rows x 3 columns]

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values: <br>
Date <br>
0 2023-01-01<br>
1 2023-01-02<br>
2 2023-01-03<br>
3 2023-01-04<br>
4 2023-01-05<br>
Your function should create the following DataFrame:<br>

Date Weekday<br>
0 2023-01-01 Sunday<br>
1 2023-01-02 Monday<br>
2 2023-01-03 Tuesday<br>
3 2023-01-04 Wednesday<br>
4 2023-01-05 Thursday<br>
The function should return the modified DataFrame.

In [28]:
import pandas as pd
data = pd.date_range(start = '2023-01-01',end='2023-01-05')
df = pd.DataFrame({'date':data})
df

        date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [33]:
def add_weekday(df):
    df['Weekday'] = df['date'].dt.day_name()
    return df

add_weekday(df)

        date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [25]:
import pandas as pd
interval = pd.Timedelta(hours=11,minutes=10,seconds=20)
data = pd.date_range(start = '2023-01-01', periods = 120, freq=interval)
df = pd.DataFrame({'Date':data})

def disp_jan_data(df):
    january_df =df.loc[(df['Date'] >= '2023-01-01') & (df['Date'] <= '2023-01-31')]
    return january_df

disp_jan_data

                  Date
0  2023-01-01 00:00:00
1  2023-01-01 11:10:20
2  2023-01-01 22:20:40
3  2023-01-02 09:31:00
4  2023-01-02 20:41:20
..                 ...
60 2023-01-28 22:20:00
61 2023-01-29 09:30:20
62 2023-01-29 20:40:40
63 2023-01-30 07:51:00
64 2023-01-30 19:01:20

[65 rows x 1 columns]